package main

import "fmt"

//Удалить i-ый элемент из слайса.

func main() {
	sl := []int{1, 2, 3, 4, 5, 6, 7, 8, 9}  //слайс
	sl2 := []int{1, 2, 3, 4, 5, 6, 7, 8, 9} //слайс для второго способа

	i := 3               //i ый элемент
	lenSl := len(sl) - 1 //последный индекс
	sl[i] = sl[lenSl]    //перезаписываем последнее значение на место индекса

	sl = sl[:lenSl] // делаем слайс без последнего элемента
	fmt.Println(sl) //[1 2 3 9 5 6 7 8]

	fmt.Println(append(sl2[:i], sl2[i+1:]...)) //второй способ

}
